first_rails_project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Banana"], ["email", "banana@gmail.com"], ["created_at", "2021-09-15 19:58:00.410325"], ["updated_at", "2021-09-15 19:58:00.410325"]]
---
  def create
    user = User.new(params.require(:user).permit(:name, :email))
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Pear"], ["email", "pear@gmail.com"], ["updated_at", "2021-09-15 20:17:04.743691"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)