art_share/app/controllers/artwork_shares_controller.rb

  def create
    share = ArtworkShare.new(artwork_shares_params)
    if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 3], ["created_at", "2021-09-16 15:07:15.808806"], ["updated_at", "2021-09-16 15:07:15.808806"]]

  def destroy
    @share = ArtworkShare.find(params[:id])
    @share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 6]]