art_share/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
  def index
    # GET /index
    if params[:user_id]
      artworks = Artwork.owned_and_shared(params[:user_id])
    else
      artworks = Artwork.all

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    # GET /artworks/:id
    @artwork = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def update
    # PATCH /users/:id
    @artwork = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 9]]
---
  def destroy
    @artwork = Artwork.find(params[:id])
    @artwork.destroy