art_share/app/controllers/comments_controller.rb

  def index
    # we want index to handle :user_id
    # or handle :artwork_id from our comment_params
    # if present, handle index accordingly for output
    if params[:user_id]
      @comments = Comment.where("comments.user_id = #{params[:user_id]}")
      # could have also done ("comments.user_id = ?", params[:id])
    elsif params[:artwork_id]
      @comments = Comment.where("comments.artwork_id = #{params[:artwork_id]}")
    else
      @comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 19]]
SELECT "artworks".* FROM "artworks"
SELECT "users".* FROM "users"
SELECT "comments".* FROM "comments" WHERE (comments.artwork_id = )

  def create
    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["artwork_id", 2], ["body", "This is a newly created comment, comment 5"], ["created_at", "2021-09-16 18:45:29.138171"], ["updated_at", "2021-09-16 18:45:29.138171"]]

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 5]]