art_share/app/controllers/users_controller.rb

  def index
    # GET /users
    if params[:username]
      @users = User.where("users.username ILIKE '#{params[:username]}'")
    end

    @users = User.all if @users.empty?
---
SELECT "users".* FROM "users" WHERE (users.username ILIKE 'wood')
SELECT  1 AS one FROM "users" WHERE (users.username ILIKE 'poop') LIMIT $1  [["LIMIT", 1]]

  def create
    user = User.new(params.require(:user).permit(:username))
    if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Evan"], ["created_at", "2021-09-16 19:25:08.801970"], ["updated_at", "2021-09-16 19:25:08.801970"]]

  def show
    # GET /users/:id
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def update
    # PATCH /users/:id
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Ben"], ["updated_at", "2021-09-16 19:26:54.439487"], ["id", 5]]